shortcuts.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2017-05-03 Wed 11:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="jayshah">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Chrome shortcuts</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Switch between tabs - Ctrl-Tab</h3>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Go to URL bar - Ctrl-L</h3>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Open New tab - Ctrl-T</h3>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Open recently closed tab - Ctrl-Shift-T</h3>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Kill current tab - Ctrl-W</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> VSCode Shortcuts</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Go to file - Ctrl-P</h3>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Toggle Drawer - Ctrl-B</h3>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Command Pallette - Ctrl-Shift-P</h3>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Fold, Unfold - Ctrl-Shift-[, Ctrl-Shift-]</h3>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Open Terminal - Ctrl-`</h3>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Switch between tabs - Ctrl-Tab</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Vim Shortcuts</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> G - end of file</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is about G key, it lets you go till the end of file
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> gg - start of file</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is about gg key it lets you go to start of file
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> y - yank</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This is for copying text, yanking means copying
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> p - paste</h3>
<div class="outline-text-3" id="text-3-4">
<p>
This is pasting text, any cut or copied text can be pasted
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Emacs Shortcuts</h2>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Intellij Shortcuts</h2>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Chrome shortcuts</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Switch between tabs - Ctrl-Tab</a></li>
<li><a href="#sec-1-2">1.2. Go to URL bar - Ctrl-L</a></li>
<li><a href="#sec-1-3">1.3. Open New tab - Ctrl-T</a></li>
<li><a href="#sec-1-4">1.4. Open recently closed tab - Ctrl-Shift-T</a></li>
<li><a href="#sec-1-5">1.5. Kill current tab - Ctrl-W</a></li>
</ul>
</li>
<li><a href="#sec-2">2. VSCode Shortcuts</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Go to file - Ctrl-P</a></li>
<li><a href="#sec-2-2">2.2. Toggle Drawer - Ctrl-B</a></li>
<li><a href="#sec-2-3">2.3. Command Pallette - Ctrl-Shift-P</a></li>
<li><a href="#sec-2-4">2.4. Fold, Unfold - Ctrl-Shift-[, Ctrl-Shift-]</a></li>
<li><a href="#sec-2-5">2.5. Open Terminal - Ctrl-`</a></li>
<li><a href="#sec-2-6">2.6. Switch between tabs - Ctrl-Tab</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Vim Shortcuts</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. G - end of file</a></li>
<li><a href="#sec-3-2">3.2. gg - start of file</a></li>
<li><a href="#sec-3-3">3.3. y - yank</a></li>
<li><a href="#sec-3-4">3.4. p - paste</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Emacs Shortcuts</a></li>
<li><a href="#sec-5">5. Intellij Shortcuts</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: jayshah</p>
<p class="date">Created: 2017-05-03 Wed 11:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org-mode</a> 9.0.4)</p>
</div>
</footer>
</body>
</html>
